pureDEM/test1/openHFDIB-STL/polyhedron_20-sided/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDEMDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

bodyNames ("sphere_Top1" "sphere_Bot1");
interpolationSchemes
{
  U cell;
}

surfaceThreshold    1e-4;
stepDEM     0.01;
geometricD (1 1 1);
recordSimulation true;
recordFirstTimeStep true;

outputSetup
{
    basic true;
    iB  true;
    DEM true;
    addModel false;
    parallelDEM true;
}
DEM
{
    materials
    {
        particle1
        {
            Y       1e8;
            nu      0.0;
            mu      0.0;
            adhN    0;
			eps		0.85;
        }

        semiIron
        {
            Y       1e8;
            nu      0.0;
            mu      0.0;
            adhN    0;
			eps		0.85;
        }    
    }
	LcCoeff 4;
}

virtualMesh
{
    level 4;
    charCellSize 1e-3;
    recordContact false;
}
sphere_Top1
{

	fullyCoupledBody
	{
		velocity (0 -1.0 0);
	}

	rho         rho [1 -3 0 0 0 0 0] 5000;

	refineMC 5;

	U
	{
	BC  noSlip;
	}

	bodyAddition
	{
		addModel   once;
		onceCoeffs{}
	}
		
	material particle1;
	bodyGeom convex;
	updateTorque false;
	sdBasedLambda false;
	interfaceSpan 1.0;
	startSynced false;
	refineBuffers 2;
	timesToSetStatic -1;
}

sphere_Bot1
{
	fullyCoupledBody
	{
		velocity (0 0 0);
	}
	rho         rho [1 -3 0 0 0 0 0] 5000;

	refineMC 5;
	U
	{
	BC  noSlip;
	}
	bodyAddition
	{
		addModel   once;
		onceCoeffs{}
	}
		
	material particle1;
	bodyGeom convex;
	updateTorque false;
	sdBasedLambda false;
	interfaceSpan 1.0;
	startSynced false;
	refineBuffers 2;
	timesToSetStatic -1;
}

// ************************************************************************* //
